{
  "auto_mapping": null,
  "base_model_name_or_path": "/mnt/sdb1/local_llm/llava-v1.5-7b",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 256,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 128,
  "revision": null,
  "target_modules": [
    "o_proj",
    "k_proj",
    "up_proj",
    "gate_proj",
    "q_proj",
    "v_proj",
    "down_proj"
  ],
  "task_type": "CAUSAL_LM"
}